using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

/*
 * 날짜:7/20
 * 이름:김현동
 * 내용:인터페이스 실습하기 교제 p425
 */
namespace ch06
{
    internal class _2
    {
        static void Main(string[] args)
        {
            ////////////////////////////////////////
            //인터페이스로 공통 클래스 구조설계에 활용
            ////////////////////////////////////////


            ////////////////////////////////////////
            //인터페이스로 다중 상속에 활용
            ////////////////////////////////////////

            ////////////////////////////////////////
            //인터페이스로 객체간 결합도 완화에 활용
            ////////////////////////////////////////

        }
    }
}
